app/views/clips/_clip.html.erb

    <strong>Artist:</strong>
    <%= clip.artists.map(&:name).to_sentence %>
---
SELECT "artists".* FROM "artists" INNER JOIN "cliphasartists" ON "artists"."id" = "cliphasartists"."artist_id" WHERE "cliphasartists"."clip_id" = ?  [["clip_id", "3"]]