app/views/scores/_form.html.erb

SELECT "musicalinstruments".* FROM "musicalinstruments"
---
    <%= form.label :musicalinstrument_id, style: "display: block" %>
    <%= form.select :musicalinstrument_id, Musicalinstrument.all.collect{|h|[h.name, h.id]} %>