app/controllers/clips_controller.rb

SELECT "clips".* FROM "clips"
---
  def index
    @clips = Clip.all

INSERT INTO "clips" ("title", "link", "artist_id", "description", "sortie", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @clip = Clip.new(clip_params)

    respond_to do |format|
      if @clip.save

SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_clip
      @clip = Clip.find(params[:id])