app/controllers/musical_pieces_controller.rb

  def index
    @musical_pieces = MusicalPiece.all
---
SELECT "musical_pieces".* FROM "musical_pieces"

  def destroy
    @musical_piece.destroy!
---
DELETE FROM "musical_pieces" WHERE "musical_pieces"."id" = ?  [["id", 1014]]

    def set_musical_piece
      @musical_piece = MusicalPiece.find(params[:id])
---
SELECT "musical_pieces".* FROM "musical_pieces" WHERE "musical_pieces"."id" = ? LIMIT ?  [["id", 332], ["LIMIT", 1]]