app/controllers/pics_controller.rb

SELECT "pics".* FROM "pics"
---
  def index
    @pics = Pic.all

INSERT INTO "pics" ("title", "composer", "pic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "viotti violin concerto 23"], ["composer", "viotti"], ["pic", "WIDORUES"], ["created_at", "2026-01-07 02:09:32.849260"], ["updated_at", "2026-01-07 02:09:32.849260"]]
---
  def create
    @pic = Pic.new(pic_params)

    respond_to do |format|
      if @pic.save

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pic
      @pic = Pic.find(params[:id])