app/controllers/scores_controller.rb

  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("title", "composer", "musicalinstrument_id", "scores", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def set_score
      @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]