app/views/layouts/application.html.erb

SELECT "musical_pieces".* FROM "musical_pieces"
---
  <body>
<%=link_to "chercher une pièce de musique au hasard", MusicalPiece.all.sample%>